app/views/patients/_new_charge.html.erb

SELECT "options".* FROM "options" WHERE ("options".procedure_id = 28)
---
        <ul>
          <% procedure.options.each do |option| %>

SELECT "types".* FROM "types" WHERE ("types".option_id = 5)
---
             <ul>
              <% option.types.each do |type| %>