app/views/patients/index.html.erb

SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM "charges" WHERE ("charges".patient_id = 3587)) AS subquery
---
              <%= link_to patient.patient_name, patient %>
              <span class="ui-li-count"><%=patient.charges.count%></span>