app/views/patients/new.html.erb


    <% @facilities = Patient.all(:select=>"DISTINCT facility"); %>
---
SELECT DISTINCT attending_md FROM "patients"