app/controllers/calendar_controller.rb

SELECT "patients".* FROM "patients" WHERE ("patients"."created_at" < '2010-12-22 05:00:00.000000') AND ("patients"."created_at" > '2010-12-21 05:00:00.000000')
---
  def index

      if params.has_key?(:date)
         # Take the calendar date, rollback to 12am
         time_stamp = Time.parse(params[:date]).midnight
       else
         # Else get today patients
         time_stamp = Time.now.midnight
       end

       records = Array.new

          if params.has_key?(:id)
            search_results = Patient.search(:id_equals=>params[:id])