app/controllers/charges_controller.rb

  def index
    @charges = Charge.all
---
SELECT * FROM "charges"

  def show
    @charge = Charge.find(params[:id])
---
SELECT * FROM "charges" WHERE ("charges"."id" = 1)

  def create

    @charge = Charge.new(params[:charge])

    respond_to do |format|
      if @charge.save
---
INSERT INTO "charges" ("doctor", "created_at", "procedure_code", "updated_at", "procedure_name", "patient_id") VALUES('Ali', '2010-08-05 14:49:05', 99291, '2010-08-05 14:49:05', NULL, '5')

  def destroy
    @charge = Charge.find(params[:id])
    @charge.destroy
---
SELECT * FROM "charges" WHERE ("charges"."id" = 4)
DELETE FROM "charges" WHERE "id" = 4

  def add

    @procedure_ids = params[:procedure_ids]
    @doctor=params[:charge][:doctor]
    logger.debug { "procedure_ids : #{@procedure_ids.inspect}" }
    logger.debug { "doctor : #{@doctor.inspect}" }

      @procedure_ids.each_with_index { | i,count|
        logger.debug "Adding Procedure #{i} for Doctor #{@doctor}"
        @charge = Charge.new(:doctor => @doctor, :procedure_code => i, :patient_id => params[:patient_id])
        @charge.save
---
INSERT INTO "charges" ("doctor", "created_at", "procedure_code", "updated_at", "procedure_name", "patient_id") VALUES('Ali', '2010-08-06 00:35:34', 1, '2010-08-06 00:35:34', NULL, NULL)