app/controllers/doctors_controller.rb

SELECT * FROM "doctors"
---
  def index
    @doctors = Doctor.all

SELECT * FROM "doctors" WHERE ("doctors"."id" = 1)
---
  def show
    @doctor = Doctor.find(params[:id])

INSERT INTO "doctors" ("doctor_pin", "created_at", "doctor_name", "updated_at", "doctor_id") VALUES('1234', '2010-08-05 00:23:35', 'Ali', '2010-08-05 00:23:35', 'ali')
---
  def create
    @doctor = Doctor.new(params[:doctor])

    respond_to do |format|
      if @doctor.save

UPDATE "doctors" SET "updated_at" = '2010-08-06 00:51:30', "doctor_id" = 'vu' WHERE "id" = 2
---
  def update
    logger.info("@@@@ #{params[:procedure_code]}")
    @doctor = current_doctor
#    @test = Test.find_by_guid(params[:CallGuid])
#    @test.update_attributes(:call_status=>"Recording Audio")

    @doctor = current_doctor

   # count_favorites(params[:procedure_ids],@doctor)

    respond_to do |format|
      if @doctor.update_attributes(params[:doctor])