app/controllers/patients_controller.rb

SELECT DISTINCT facility FROM "patients"
SELECT "patients".* FROM "patients" WHERE ("patients"."discharged" = 'f') AND ("patients"."date_last_added" <= '2010-12-26 05:00:00.000000') AND ("patients"."facility" = 'ALTAMONTE') AND ("patients"."date_last_added" >= '2010-12-25 05:00:00.000000') ORDER BY patients.room ASC
---
  def index
     #distinct list of facilities
     @list =   Patient.all(:select=>"DISTINCT facility")

     if Patient.all.length==0
       logger.debug("NO RECORDS")
       #redirect_to(:controller => "admin", :action => "index")
       @search = []
     else

       if params.has_key?(:location)
         @search = Patient.order('patients.room ASC').search(:facility_equals=>params[:location],:discharged_equals=>false).where({:date_last_added.eq=>Time.now.midnight})

SELECT "patients".* FROM "patients" WHERE ("patients"."id" = 2952) LIMIT 1
---
  def show
    require 'rbyaml'
    @patient = Patient.find(params[:id])

SELECT DISTINCT attending_md FROM "patients"
---
  def new
    @facilities_list  = Patient.all(:select=>"DISTINCT facility");

SELECT * FROM "patients" WHERE ("patients"."id" = 5)
---
  def edit
    @patient = Patient.find(params[:id])

INSERT INTO "patients" ("fin", "bed", "consult_md", "created_at", "patient_been_seen", "attending_md", "updated_at", "facility", "unit", "sex", "patient_name", "admitted", "room", "age", "mrn") VALUES('1', '1', '1', '2010-08-05 01:00:06', 'f', '1', '2010-08-05 01:00:06', '1', '1', '1', '1', '2010-08-05', '1', 1, '1')
---
  def create
    @patient = Patient.new(params[:patient])

    respond_to do |format|
      if @patient.save

SELECT * FROM "patients" WHERE ("patients"."id" = 2)
UPDATE "patients" SET "updated_at" = '2010-08-05 01:28:35', "consult_md" = '', "patient_been_seen" = 'f' WHERE "id" = 2
---
  def update
    @patient = Patient.find(params[:id])

    respond_to do |format|
      if @patient.update_attributes(params[:patient])

SELECT * FROM "patients" WHERE ("patients"."id" = 1)
DELETE FROM "patients" WHERE "id" = 1
---
  def destroy
    @patient = Patient.find(params[:id])
    @patient.destroy