app/controllers/procedures_controller.rb

SELECT * FROM "procedures"
---
  def index
    @procedures = Procedure.all